import pandas as pd

data = {'Days':[-789, 344, 600, 16790, -879070979, 0, 500000, 9000], 'Age':[20, 21, 19, 64, 37, 18, 75, 45]}
df = pd.DataFrame(data)

print(df)
print("-------------------")

# Замена отрицательных значений абсолютными
df['Days'][df['Days'] < 0] = abs(df['Days'])

print(df)
print("-------------------")

# Замена зашкаливающих значений максимальным количеством
# дней которые человек мог отработать после 18 лет
maxDays =  365 * (df['Age'] - 18)
df['Days'][df['Days'] > maxDays] = maxDays

print(df)
print("-------------------")